text = "бородино"
print ("\n"*3,"\t"*3,"  ",text.upper())

print ("\n"*3,"\t"*2," — Скажи-ка, дядя, "+"ведь не даром")
print ("\t"*2,"   Москва, спаленная"+" пожаром,")
print ("\t"*3,"Французу"+" отдана?")
print ("\t"*2,"   Ведь были ж схватки"+" боевые,")
print ("\t"*2,"     Да, говорят, еще"+" какие!")
print ("\t"*2,"    Недаром помнит вся"+" Россия")
print ("\t"*3,"Про день "+"Бородина! ")


print ("\n"*3,"\t"*2," — Да, были люди в"+" наше время,")
print ("\t"*2,"   Не то, что нынешнее"+" племя:")
print ("\t"*3,"Богатыри — не "+"вы!")
print ("\t"*2,"    Плохая им досталась доля:")
print ("\t"*2,"  Немногие вернулись с поля...")
print ("\t"*2,"  Не будь на то господня воля,")
print ("\t"*3,"Не отдали б Москвы! ")


print ("\n"*3,"\t"*2,"    Мы долго молча отступали,")
print ("\t"*2,"     Досадно было, боя ждали,")
print ("\t"*3,"Ворчали старики:")
print ("\t"*2," «Что ж мы? на зимние квартиры? ")
print ("\t"*2,"  Не смеют, что ли, командиры")
print ("\t"*2,"    Чужие изорвать мундиры")
print ("\t"*3,"О русские штыки?»")
